# Вторая задача:
# В настольной игре Скрабл (Scrabble) каждая буква имеет определенную ценность.
# В случае с английским алфавитом очки распределяются так:
# A, E, I, O, U, L, N, S, T, R – 1 очко;
# D, G – 2 очка;
# B, C, M, P – 3 очка;
# F, H, V, W, Y – 4 очка;
# K – 5 очков;
# J, X – 8 очков;
# Q, Z – 10 очков.
# А русские буквы оцениваются так:
# А, В, Е, И, Н, О, Р, С, Т – 1 очко;
# Д, К, Л, М, П, У – 2 очка;
# Б, Г, Ё, Ь, Я – 3 очка;
# Й, Ы – 4 очка;
# Ж, З, Х, Ц, Ч – 5 очков;
# Ш, Э, Ю – 8 очков;
# Ф, Щ, Ъ – 10 очков
#
# Напишите программу, которая вычисляет стоимость введенного пользователем слова.
# Будем считать, что на вход подается только одно слово, которое содержит либо
# только английские, либо только русские буквы.

word = input("Введите слово (англ. или рус.): ")
word = word.upper()
points = 0
eng_1 = ['A', 'E', 'I', 'O', 'U', 'L', 'N', 'S', 'T', 'R']
eng_2 = ['D', 'G']
eng_3 = ['B', 'C', 'M', 'P']
eng_4 = ['F', 'H', 'V', 'W', 'Y']
eng_5 = ['K']
eng_8 = ['J', 'X']
eng_10 = ['Q', 'Z']
ru_1 = ['А', 'В', 'Е', 'И', 'Н', 'О', 'Р', 'С', 'Т']
ru_2 = ['Д', 'К', 'Л', 'М', 'П', 'У']
ru_3 = ['Б', 'Г', 'Ё', 'Ь', 'Я']
ru_4 = ['Й', 'Ы']
ru_5 = ['Ж', 'З', 'Х', 'Ц', 'Ч']
ru_8 = ['Ш', 'Э', 'Ю']
ru_10 = ['Ф', 'Щ', 'Ъ']
i = 0
while i < len(word):
    if word[i] in eng_1 or word[i] in ru_1:
        points += 1
    elif word[i] in eng_2 or word[i] in ru_2:
        points += 2
    elif word[i] in eng_3 or word[i] in ru_3:
        points += 3
    elif word[i] in eng_4 or word[i] in ru_4:
        points += 4
    elif word[i] in eng_5 or word[i] in ru_5:
        points += 5
    elif word[i] in eng_8 or word[i] in ru_8:
        points += 8
    elif word[i] in eng_10 or word[i] in ru_10:
        points += 10
    i += 1
print(f'Количество очков в слове {word} - {points}')







